package com.example.demo.entity.enums;

public enum UserTagType {
    맛집, 번개, 핫플, 연합, 프로젝트, 기획, 친목, 보드게임, 술, 여행, AI,
    부트캠프, 블로그, 스터디, 멘토링, 개발, 데이터, 수학, 세미나, 튜터링, 경기도, 노래,
    버스킹, 정기공연, 밴드, 수도권, 애니메이션, 덕질, 만화카페, 서브컬쳐, 모션그래픽, SNS,
    독서, 영어회화, 전화, 합주, 온라인, 채플, 선교, 수련회, 사진, 출사, 부스,
    사진전, 미디어, K_POP, 콘텐츠, 아이돌, 방송, 연예, 마케팅, 추리, 스누핑,
    방탈출, 향수, 견학, 축구, 풋살, 태권도, 체육대회, 자과캠, 명륜캠, 당구, 심리학,
    굿즈, 제작, 불교, 템플스테이, 법회, 문화생활, 전시회, 글쓰기, 합평, 봉사,
    유기동물, 야구, 공대, 문화, 예술, 매거진, 파티, 디제잉, 성소수자, 퀴어,
    영상, 촬영, 포트폴리오, 바둑, 걷기, 농구, 음악, 감상, 클래식, 연주회,
    영화, 스피치, 발표, 레저스포츠, 풍물패, 국악, 교환학생, 시나리오, 작곡, 합창,
    역사, 피아노, 연극, 연기, 지휘, 미술, 스케치, 창업, loT, 공모전,
    게임, 롤, 롤토체스, 발로란트, 디자인, 뮤지컬, 정보, 보안, 여자농구, 시사,
    사회, 토론, 베이커리, 빵, 피트니스, 포토샵, 배우, 극본, 만화, 그림,
    고전, 인문, 러닝, 배드민턴, 강연, 고양이, 댄스스포츠, 댄스, 라틴댄스, 마술,
    공연, 보컬, 힙합, 세션, 타로, 카드, 헬스, 운동, 채식, 비건,
    버킷리스트
}
